# Sets (уникална колекция от елементи) a = {} къдрави скобки, curly brackets

# set-ът е unordered collection - сетът не пази реда
# всеки елемент от сета е уникален
# сетът е mutable - можем да го променяме, добавяме, премахваме
# сетът е изключително бърз O(1)
# сетът не се индексира - там нямаме индекси

# превръщаме list в set и премахваме автоматично всички повтарящи се елементи
lst = [1, 2, 3, 1]
print(lst)

b = set(lst)
print(b)  # изчезнаха повтарящите се елементи с превръщането на листа в сет

# union | оператор в set - обединява два сета + елиминира всички повтарящи се елементи
a = {1, 2, 3, 4}
b = {3, 4, 5, 6}

union = a | b
print(union)

# intersection & оператор в set - показва/запазва само повтарящите се елементи в двата сета

intersection = a & b
print(intersection)

# sebset - a < b - търси отделните елементи от единия сет, дали са част от другия сет

subset = a < b
print(subset)

# diff = a - b - дай ми всички елементи от а, които не се повтарят в b

diff = a - b
print(diff)

# symmetric diff - които не се повтарят и в a и в b

sym_diff = a ^ b
print(sym_diff)

# как да

