#
# a = [1, 2, 3, 1] # brackets []
# print(f'Аз съм: {type(a)}')
# print(a)

# a = (1, 2, 3, 1) # unmutable (unchangeble), cannot be updated, parenthesis ()
# print(f'Аз съм: {type(a)}')
# print(a)

# a = {12, 2, 3, 4, 5, 1, 'к', 8, 9, 300} # 'къдрави скобки', 'уникална колекция от неповтарящи се (недублиращи се) елементи', неподреден (без индекси)
# print(f'Аз съм: {type(a)}')
# print(a)

a = {} # ако искаме да инициираме къдрави скобки без нищо, то то ни дава дикт
print(f'Аз съм: {type(a)}')

b = {1  } # ако искаме да инициираме къдрави скобки без нищо, то то ни дава дикт
print(f'Аз съм: {type(b)}')


# a= {'Baba Vanga': 6, 'Kaka Mara': 7}
# print(f'Аз съм: {type(a)}')
# print(a)

