# сплитваме списъка и едновременно превръщаме стринговете в int с помощта на map
lst = list(map(int, input().split('.')))
# увеличаваме последното число [-1] с единица
lst[-1] += 1

# въртим цикъл, чиято дължина е броя на числата в списъка в обратен ред (от -1 до 0) със стъпка -1
for i in range(len(lst) - 1, 0, -1):
    # ако числото е по-голямо от 9, го зануляваме, а предходното го увеличаваме с 1
    if lst[i] > 9:
        lst[i] = 0
        lst[i - 1] += 1
# принтираме списъка *lst, като числата в него са разделени с точка
print(*lst, sep='.')

# Версия на Иван Шопов

version = [int(number) for number in input().split('.')]
